

import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';

class RowWidget extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        body: Column(
          children: [
            //سرچ باکس 
            Container(
              width: MediaQuery.of(context).size.width,
              height: 38,
              margin: EdgeInsets.all(10.0),
              padding: EdgeInsets.all(5.0),
              decoration: BoxDecoration(
                color: Colors.white,
                borderRadius: BorderRadius.circular(5.0),
              ),
              //آیکون سرچ 
              child: SvgPicture.string(
                _svg_8sw3lm,
                alignment: Alignment.bottomRight,
                width: 5,
                height: 5,
              ),
            ),
            //باکس طبقه و پاساژ
            Container(
              width: MediaQuery.of(context).size.width,
              margin: EdgeInsets.all(10.0),
              padding: EdgeInsets.all(5.0),
              decoration: BoxDecoration(
                color: Colors.white,
                borderRadius: BorderRadius.circular(5.0),
              ),
              child: Column(
                children: [
                  Container(
                    child: Column(
                      children: [
                        Row(
                          mainAxisAlignment: MainAxisAlignment.spaceBetween,
                          children: [
                            Container(
                              padding: EdgeInsets.all(5.0),
                              child: Text(
                                "پاساژ",
                              ),
                            ),
                            Container(
                              padding: EdgeInsets.all(5.0),
                              child: Text(
                                ":",
                              ),
                            ),
                            Container(
                              padding: EdgeInsets.all(5.0),
                              child: Text(
                                "امیران",
                              ),
                            ),
                            Container(
                              padding: EdgeInsets.all(5.0),
                              child: Icon(
                                Icons.arrow_circle_down,
                              ),
                            ),
                          ],
                        )
                        // list
                      ],
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(5.0),
                    child: Divider(
                      height: 1.0,
                      thickness: 1.0,
                    ),
                  ),
                  Container(
                    child: Column(
                      children: [
                        Stack(
                          children: [
                            Row(
                              mainAxisAlignment: MainAxisAlignment.spaceBetween,
                              children: [
                                Container(
                                  padding: EdgeInsets.all(5.0),
                                  child: Text(
                                    "طبقه",
                                  ),
                                ),
                                Container(
                                  padding: EdgeInsets.all(5.0),
                                  child: Text(
                                    ":",
                                  ),
                                ),
                                Container(
                                  padding: EdgeInsets.all(5.0),
                                  child: Text(
                                    "هشتم",
                                  ),
                                ),
                                Container(
                                  padding: EdgeInsets.all(5.0),
                                  child: Icon(
                                    Icons.arrow_circle_down,
                                  ),
                                ),
                              ],
                            ),
                            //بابت تشکیل و سایه پاپ اپ منو
                            // Transform.translate(
                            //   offset: Offset(4, 25),
                            //   child: Container(
                            //     padding: const EdgeInsets.all(15.0),

                            //     width: 200,
                            //     decoration: BoxDecoration(
                            //         boxShadow: [
                            //           BoxShadow(
                            //             color: Colors.grey.withOpacity(0.5),
                            //             spreadRadius: 5,
                            //             blurRadius: 7,
                            //             offset: Offset(
                            //                 0, 3), // changes position of shadow
                            //           ),
                            //         ],
                            //         color: Colors.white,
                            //         borderRadius: BorderRadius.circular(15.0)),
                            //     height: 100.0,
                            //     //fit: FlexFit.tight,
                            //     child: ListView(
                            //       children: [
                            //         Text("vd"),
                            //         Text("vdv"),
                            //         Text("vll"),
                            //         Text("cscs"),
                            //         Text("vvdv"),
                            //         Text("svs"),
                            //         Text("fed"),
                            //         Text("cscs"),
                            //       ],
                            //     ),
                            //   ),
                            // )
                          ],
                        ),
                      ],
                    ),
                  ),
                ],
              ),
            ),],
            ),
            ),
            );
            }}
            const String _svg_8sw3lm =
    '<svg viewBox="9.8 6.0 19.4 19.4" ><path transform="translate(1333.79, 90.46)" d="M -1305.815185546875 -65.26988220214844 L -1310.534423828125 -69.98625946044922 C -1311.9599609375 -68.78908538818359 -1313.797729492188 -68.06724548339844 -1315.800415039063 -68.06724548339844 C -1320.321044921875 -68.06724548339844 -1324 -71.74378204345703 -1324 -76.26252746582031 C -1324 -80.78226470947266 -1320.322021484375 -84.45780181884766 -1315.800415039063 -84.45780181884766 C -1311.279663085938 -84.45780181884766 -1307.601806640625 -80.78126525878906 -1307.601806640625 -76.26252746582031 C -1307.601806640625 -74.26240539550781 -1308.322509765625 -72.42717742919922 -1309.51806640625 -71.00285339355469 L -1304.802001953125 -66.28892517089844 C -1304.546875 -66.04415893554688 -1304.520629882813 -65.61956024169922 -1304.743774414063 -65.33982086181641 C -1304.761962890625 -65.31684112548828 -1304.78125 -65.29486083984375 -1304.802001953125 -65.27487945556641 C -1304.941528320313 -65.13901519775391 -1305.122802734375 -65.06407928466797 -1305.309448242188 -65.06607818603516 L -1305.30859375 -65.06008148193359 C -1305.311157226563 -65.06005096435547 -1305.3134765625 -65.06004333496094 -1305.31591796875 -65.06004333496094 C -1305.5 -65.06004333496094 -1305.677734375 -65.13479614257813 -1305.815185546875 -65.26988220214844 Z M -1322.566040039063 -76.26252746582031 C -1322.566040039063 -72.53403472900391 -1319.53125 -69.50090026855469 -1315.800415039063 -69.50090026855469 C -1313.9873046875 -69.50090026855469 -1312.338745117188 -70.21758270263672 -1311.123413085938 -71.38240814208984 C -1311.113037109375 -71.39763641357422 -1311.102416992188 -71.41256713867188 -1311.091186523438 -71.42707824707031 C -1311.071166992188 -71.45205688476563 -1311.049194335938 -71.47502899169922 -1311.026489257813 -71.49701690673828 C -1310.99462890625 -71.52769470214844 -1310.961181640625 -71.55502319335938 -1310.92626953125 -71.57897186279297 C -1309.756713867188 -72.79499053955078 -1309.036743164063 -74.44629669189453 -1309.036743164063 -76.26252746582031 C -1309.036743164063 -79.99100494384766 -1312.0712890625 -83.02415466308594 -1315.800415039063 -83.02415466308594 C -1319.5302734375 -83.02415466308594 -1322.566040039063 -79.99100494384766 -1322.566040039063 -76.26252746582031 Z M -1321.056396484375 -75.37835693359375 C -1321.2021484375 -76.87294769287109 -1320.680053710938 -78.35155487060547 -1319.6552734375 -79.34961700439453 C -1319.365356445313 -79.62934875488281 -1318.931762695313 -79.62934875488281 -1318.641235351563 -79.34961700439453 C -1318.386108398438 -79.10485076904297 -1318.359619140625 -78.68024444580078 -1318.582885742188 -78.40050506591797 C -1318.60107421875 -78.37752532958984 -1318.620239257813 -78.35555267333984 -1318.641235351563 -78.3355712890625 C -1319.366333007813 -77.62824249267578 -1319.735229492188 -76.57923126220703 -1319.630615234375 -75.52122497558594 C -1319.605834960938 -75.11460113525391 -1319.886474609375 -74.76393890380859 -1320.25732421875 -74.73795318603516 L -1320.272705078125 -74.73596954345703 L -1320.3447265625 -74.73596954345703 L -1320.343872070313 -74.73297119140625 C -1320.352416992188 -74.73262786865234 -1320.361206054688 -74.73246002197266 -1320.369506835938 -74.73246002197266 C -1320.711303710938 -74.73245239257813 -1321.003784179688 -75.00498962402344 -1321.056396484375 -75.37835693359375 Z" fill="#7b7b7b" stroke="#000000" stroke-width="1" stroke-opacity="0.0" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';

const String _svg_uo6bsg =
    '<svg viewBox="0.0 0.0 70.0 48.6" ><path transform="matrix(-1.0, 0.0, 0.0, -1.0, 70.0, 48.62)" d="M 28.50740051269531 9.018816947937012 C 31.69990539550781 4.584134101867676 38.30009460449219 4.584134101867676 41.49259948730469 9.018816947937012 L 60.87606811523438 35.94423294067383 C 64.68568420410156 41.23613739013672 60.90400695800781 48.61821746826172 54.38346099853516 48.61821746826172 L 15.61653614044189 48.61821746826172 C 9.095993041992188 48.61821746826172 5.314320087432861 41.23613739013672 9.123937606811523 35.94423294067383 Z" fill="#eb5151" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
